/*
将1，2，…，9共9个数分成三组，分别组成三个
三位数，且使这三个三位数构成  1:2:3的比例，
试求出所有满足条件的三个三位数。

例如：三个三位数192，384，576满足以上条件。
*/
#include<iostream>
using namespace std;
int main() {
	for(int i=123;i<=333;i++){
		int a[10]={0};
		a[i/100]=1;
		a[i/10%10]=1;
		a[i%10]=1;
		int j=i*2;
		a[j/100]=1;
		a[j/10%10]=1;
		a[j%10]=1;
		int k=i*3;
		a[k/100]=1;
		a[k/10%10]=1;
		a[k%10]=1;
		int sum=0;
		for(int m=0;m<10;m++){
			sum+=a[m];
		}
		//三个数字的每个位数刚好位于0~9之间，且都只出现了一次 
		if(sum==9){
			cout<<i<<" "<<j<<" "<<k<<endl;
		}
	}
	return 0;
}
